IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_sd_storage.c
static uint32_t Camera_SDStorage_GetPinMode(
    GPIO_TypeDef *port,
    uint32_t pin_number)
{
    return (port->MODER >> (pin_number * 2U)) & 0x3U;
}

static uint32_t Camera_SDStorage_GetPinPull(
    GPIO_TypeDef *port,
    uint32_t pin_number)
{
    return (port->PUPDR >> (pin_number * 2U)) & 0x3U;
}

static uint32_t Camera_SDStorage_GetPinSpeed(
    GPIO_TypeDef *port,
    uint32_t pin_number)
{
    return (port->OSPEEDR >> (pin_number * 2U)) & 0x3U;
}

static uint32_t Camera_SDStorage_GetPinAf(
    GPIO_TypeDef *port,
    uint32_t pin_number)
{
    if (pin_number < 8U)
    {
        return (port->AFR[0] >> (pin_number * 4U)) & 0xFU;
    }

    return (port->AFR[1] >> ((pin_number - 8U) * 4U)) & 0xFU;
}

static void Camera_SDStorage_CaptureFullGpioReadback(void)
{
    s_camera_sd_status.sdio_full_gpio_pc8_mode =
        Camera_SDStorage_GetPinMode(GPIOC, 8U);
    s_camera_sd_status.sdio_full_gpio_pc8_pull =
        Camera_SDStorage_GetPinPull(GPIOC, 8U);
    s_camera_sd_status.sdio_full_gpio_pc8_speed =
        Camera_SDStorage_GetPinSpeed(GPIOC, 8U);
    s_camera_sd_status.sdio_full_gpio_pc8_af =
        Camera_SDStorage_GetPinAf(GPIOC, 8U);
    s_camera_sd_status.sdio_full_gpio_pc9_mode =
        Camera_SDStorage_GetPinMode(GPIOC, 9U);
    s_camera_sd_status.sdio_full_gpio_pc9_pull =
        Camera_SDStorage_GetPinPull(GPIOC, 9U);
    s_camera_sd_status.sdio_full_gpio_pc9_speed =
        Camera_SDStorage_GetPinSpeed(GPIOC, 9U);
    s_camera_sd_status.sdio_full_gpio_pc9_af =
        Camera_SDStorage_GetPinAf(GPIOC, 9U);
    s_camera_sd_status.sdio_full_gpio_pc10_mode =
        Camera_SDStorage_GetPinMode(GPIOC, 10U);
    s_camera_sd_status.sdio_full_gpio_pc10_pull =
        Camera_SDStorage_GetPinPull(GPIOC, 10U);
    s_camera_sd_status.sdio_full_gpio_pc10_speed =
        Camera_SDStorage_GetPinSpeed(GPIOC, 10U);
    s_camera_sd_status.sdio_full_gpio_pc10_af =
        Camera_SDStorage_GetPinAf(GPIOC, 10U);
    s_camera_sd_status.sdio_full_gpio_pc11_mode =
        Camera_SDStorage_GetPinMode(GPIOC, 11U);
    s_camera_sd_status.sdio_full_gpio_pc11_pull =
        Camera_SDStorage_GetPinPull(GPIOC, 11U);
    s_camera_sd_status.sdio_full_gpio_pc11_speed =
        Camera_SDStorage_GetPinSpeed(GPIOC, 11U);
    s_camera_sd_status.sdio_full_gpio_pc11_af =
        Camera_SDStorage_GetPinAf(GPIOC, 11U);
    s_camera_sd_status.sdio_full_gpio_pc12_mode =
        Camera_SDStorage_GetPinMode(GPIOC, 12U);
    s_camera_sd_status.sdio_full_gpio_pc12_pull =
        Camera_SDStorage_GetPinPull(GPIOC, 12U);
    s_camera_sd_status.sdio_full_gpio_pc12_speed =
        Camera_SDStorage_GetPinSpeed(GPIOC, 12U);
    s_camera_sd_status.sdio_full_gpio_pc12_af =
        Camera_SDStorage_GetPinAf(GPIOC, 12U);
    s_camera_sd_status.sdio_full_gpio_pd2_mode =
        Camera_SDStorage_GetPinMode(GPIOD, 2U);
    s_camera_sd_status.sdio_full_gpio_pd2_pull =
        Camera_SDStorage_GetPinPull(GPIOD, 2U);
    s_camera_sd_status.sdio_full_gpio_pd2_speed =
        Camera_SDStorage_GetPinSpeed(GPIOD, 2U);
    s_camera_sd_status.sdio_full_gpio_pd2_af =
        Camera_SDStorage_GetPinAf(GPIOD, 2U);
}

static uint32_t Camera_SDStorage_FindFullGpioErrorPin(void)
{
    uint32_t index;

    for (index = 0U;
         index < (sizeof(s_camera_sd_lines) / sizeof(s_camera_sd_lines[0]));
         ++index)
    {
        const Camera_SDLineDef_t *line = &s_camera_sd_lines[index];

        if ((Camera_SDStorage_GetPinMode(line->port, line->pin_number) != 2U) ||
            (Camera_SDStorage_GetPinPull(line->port, line->pin_number) !=
             GPIO_PULLUP) ||
            (Camera_SDStorage_GetPinSpeed(line->port, line->pin_number) !=
             GPIO_SPEED_FREQ_VERY_HIGH) ||
            (Camera_SDStorage_GetPinAf(line->port, line->pin_number) != 12U) ||
            (((line->port->OTYPER >> line->pin_number) & 0x1U) != 0U))
        {
            return (line->port == GPIOC)
                ? line->pin_number
                : CAMERA_SD_FULL_GPIO_ERROR_PIN_PD2;
        }
    }

    return CAMERA_SD_FULL_GPIO_ERROR_PIN_NONE;
}

static uint32_t Camera_SDStorage_GetPinIdr(
    GPIO_TypeDef *port,
    uint32_t pin_number)
{
    return (port->IDR >> pin_number) & 0x1U;
}

static void Camera_SDStorage_AnalyzeAtk1BitReadBuffer(
    const uint8_t *buffer,
    uint32_t length)
{
    uint32_t index;
    uint32_t sum = 0U;
    uint32_t xor_value = 0U;
    uint32_t nonzero_count = 0U;
    uint32_t zero_count = 0U;
    uint32_t ff_count = 0U;
    uint32_t prefill_count = 0U;
    uint32_t changed_count = 0U;
    uint32_t first_changed_index = CAMERA_SD_READ_NO_CHANGED_INDEX;
    uint32_t last_changed_index = CAMERA_SD_READ_NO_CHANGED_INDEX;

    if ((buffer == NULL) || (length != CAMERA_SD_READ_BUFFER_LEN))
    {
        s_camera_sd_status.atk_1bit_buffer_inspected = 0U;
        s_camera_sd_status.atk_1bit_buffer_len = 0U;
        return;
    }

    for (index = 0U; index < length; ++index)
    {
        uint32_t value = buffer[index];

        sum += value;
        xor_value ^= value;
        if (value != 0U)
        {
            ++nonzero_count;
        }
        else
        {
            ++zero_count;
        }

        if (value == 0xFFU)
        {
            ++ff_count;
        }

        if (value == CAMERA_SD_READ_PREFILL_PATTERN)
        {
            ++prefill_count;
        }
        else
        {
            if (changed_count == 0U)
            {
                first_changed_index = index;
            }
            last_changed_index = index;
            ++changed_count;
        }
    }

    s_camera_sd_status.atk_1bit_buffer_inspected = 1U;
    s_camera_sd_status.atk_1bit_buffer_len = length;
    s_camera_sd_status.atk_1bit_prefill_pattern =
        CAMERA_SD_READ_PREFILL_PATTERN;
    s_camera_sd_status.atk_1bit_buffer_sum512 = sum;
    s_camera_sd_status.atk_1bit_buffer_xor512 = xor_value;
    s_camera_sd_status.atk_1bit_buffer_nonzero_count512 = nonzero_count;
    s_camera_sd_status.atk_1bit_buffer_zero_count512 = zero_count;
    s_camera_sd_status.atk_1bit_buffer_ff_count512 = ff_count;
    s_camera_sd_status.atk_1bit_buffer_prefill_count512 = prefill_count;
    s_camera_sd_status.atk_1bit_buffer_changed_count512 = changed_count;
    s_camera_sd_status.atk_1bit_buffer_changed =
        (changed_count > 0U) ? 1U : 0U;
    s_camera_sd_status.atk_1bit_buffer_all_prefill =
        (prefill_count == length) ? 1U : 0U;
    s_camera_sd_status.atk_1bit_buffer_all_zero =
        (zero_count == length) ? 1U : 0U;
    s_camera_sd_status.atk_1bit_buffer_all_ff =
        (ff_count == length) ? 1U : 0U;
    s_camera_sd_status.atk_1bit_buffer_first_changed_index =
        first_changed_index;
    s_camera_sd_status.atk_1bit_buffer_last_changed_index =
        last_changed_index;
    memcpy(s_camera_sd_status.atk_1bit_buffer_first16, buffer,
           sizeof(s_camera_sd_status.atk_1bit_buffer_first16));
    memcpy(s_camera_sd_status.atk_1bit_buffer_first32, buffer,
           sizeof(s_camera_sd_status.atk_1bit_buffer_first32));
    memcpy(s_camera_sd_status.atk_1bit_buffer_tail16,
           &buffer[length - sizeof(s_camera_sd_status.atk_1bit_buffer_tail16)],
           sizeof(s_camera_sd_status.atk_1bit_buffer_tail16));
}

static uint32_t Camera_SDStorage_ApplyAtkOfficialSdioGpioConfig(void)
{
    GPIO_InitTypeDef gpio = {0};
    uint32_t index;

    ++s_camera_sd_status.atk_official_gpio_config_attempt_count;

    __HAL_RCC_GPIOC_CLK_ENABLE();
    __HAL_RCC_GPIOD_CLK_ENABLE();

    gpio.Pin = CAMERA_SD_FULL_GPIOC_PIN_MASK;
    gpio.Mode = GPIO_MODE_AF_PP;
    gpio.Pull = GPIO_PULLUP;
    gpio.Speed = GPIO_SPEED_FREQ_HIGH;
    gpio.Alternate = GPIO_AF12_SDIO;
    HAL_GPIO_Init(GPIOC, &gpio);

