IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_sd_storage.c
    gpio.Pin = CAMERA_SD_FULL_GPIOD_PIN_MASK;
    HAL_GPIO_Init(GPIOD, &gpio);

    for (index = 0U;
         index < (sizeof(s_camera_sd_lines) / sizeof(s_camera_sd_lines[0]));
         ++index)
    {
        const Camera_SDLineDef_t *line = &s_camera_sd_lines[index];

        if ((Camera_SDStorage_GetPinMode(line->port, line->pin_number) != 2U) ||
            (Camera_SDStorage_GetPinPull(line->port, line->pin_number) !=
             GPIO_PULLUP) ||
            (Camera_SDStorage_GetPinSpeed(line->port, line->pin_number) !=
             GPIO_SPEED_FREQ_HIGH) ||
            (Camera_SDStorage_GetPinAf(line->port, line->pin_number) != 12U))
        {
            return CAMERA_SD_ERR_SDIO_FULL_GPIO_SWITCH_FAILED;
        }
    }

    ++s_camera_sd_status.atk_official_gpio_config_success_count;
    return CAMERA_SD_OK;
}

static void Camera_SDStorage_PrepareSdHandle(void)
{
    hsd_snapshot.Instance = SDIO;
    hsd_snapshot.Init.ClockEdge = SDIO_CLOCK_EDGE_RISING;
    hsd_snapshot.Init.ClockBypass = SDIO_CLOCK_BYPASS_DISABLE;
    hsd_snapshot.Init.ClockPowerSave = SDIO_CLOCK_POWER_SAVE_DISABLE;
    /* Stage 11C-4 保持 1-bit 初始化，不切换 4-bit，也不配置宽总线。 */
    hsd_snapshot.Init.BusWide = SDIO_BUS_WIDE_1B;
    hsd_snapshot.Init.HardwareFlowControl =
        SDIO_HARDWARE_FLOW_CONTROL_DISABLE;
    /* 编译期固定分频用于 C5J 单固件、单参数的 SDIO 采样稳定性对照。 */
    hsd_snapshot.Init.ClockDiv = CAMERA_SD_INIT_CLOCK_DIV;
    /* Stage 11C-4 读取 HAL 层卡信息，不接 FATFS，不执行块读写。 */
}

static void Camera_SDStorage_PrepareAtkOfficialSdHandle(void)
{
    hsd_snapshot.Instance = SDIO;
    hsd_snapshot.Init.ClockEdge = SDIO_CLOCK_EDGE_RISING;
    hsd_snapshot.Init.ClockBypass = SDIO_CLOCK_BYPASS_DISABLE;
    hsd_snapshot.Init.ClockPowerSave = SDIO_CLOCK_POWER_SAVE_DISABLE;
    hsd_snapshot.Init.BusWide = SDIO_BUS_WIDE_1B;
    hsd_snapshot.Init.HardwareFlowControl =
        SDIO_HARDWARE_FLOW_CONTROL_DISABLE;
    hsd_snapshot.Init.ClockDiv = 1U;
}

static void Camera_SDStorage_EnableSdioClock(void)
{
    __HAL_RCC_SDIO_CLK_ENABLE();
    s_camera_sd_status.sdio_clock_enabled = 1U;
}

static void Camera_SDStorage_DisableSdioClock(void)
{
    __HAL_RCC_SDIO_CLK_DISABLE();
    s_camera_sd_status.sdio_clock_enabled = 0U;
}

static uint32_t Camera_SDStorage_ReadCardInfo(void)
{
    uint32_t start_ms;
    HAL_StatusTypeDef hal_status;
    HAL_SD_CardInfoTypeDef card_info;

    if ((s_camera_sd_status.is_initialized != 1U) ||
        (s_camera_sd_status.sdio_ready != 1U))
    {
        /* HAL_SD_Init 未成功时禁止访问卡信息，也不增加实际读取计数。 */
        return CAMERA_SD_ERR_SDIO_HAL_INIT_FAILED;
    }

    ++s_camera_sd_status.card_info_read_attempt_count;
    start_ms = HAL_GetTick();
    hal_status = HAL_SD_GetCardInfo(&hsd_snapshot, &card_info);
    s_camera_sd_status.last_card_info_operation_ms =
        HAL_GetTick() - start_ms;
    s_camera_sd_status.last_card_info_status = (uint32_t)hal_status;
    s_camera_sd_status.last_card_info_error = HAL_SD_GetError(&hsd_snapshot);
    s_camera_sd_status.last_hal_sd_state =
        (uint32_t)HAL_SD_GetState(&hsd_snapshot);
    s_camera_sd_status.last_hal_sd_card_state =
        (uint32_t)HAL_SD_GetCardState(&hsd_snapshot);

    if (hal_status == HAL_OK)
    {
        ++s_camera_sd_status.card_info_read_success_count;
        s_camera_sd_status.card_type = card_info.CardType;
        s_camera_sd_status.card_version = card_info.CardVersion;
        s_camera_sd_status.card_class = card_info.Class;
        s_camera_sd_status.card_rel_card_add = card_info.RelCardAdd;
        s_camera_sd_status.card_block_nbr = card_info.BlockNbr;
        s_camera_sd_status.card_block_size = card_info.BlockSize;
        s_camera_sd_status.card_log_block_nbr = card_info.LogBlockNbr;
        s_camera_sd_status.card_log_block_size = card_info.LogBlockSize;
        s_camera_sd_status.last_error_code = CAMERA_SD_OK;
        return CAMERA_SD_OK;
    }

    ++s_camera_sd_status.card_info_read_error_count;
    s_camera_sd_status.last_error_code = CAMERA_SD_ERR_CARD_INFO_FAILED;
    return CAMERA_SD_ERR_CARD_INFO_FAILED;
}

static uint32_t Camera_SDStorage_WaitCardTransfer(uint32_t timeout_ms)
{
    uint32_t start_ms;
    uint32_t elapsed_ms;
    HAL_SD_CardStateTypeDef card_state;

    if ((s_camera_sd_status.is_initialized != 1U) ||
        (s_camera_sd_status.sdio_ready != 1U))
    {
        s_camera_sd_status.last_error_code =
            CAMERA_SD_ERR_BLOCK_READ_NOT_READY;
        return CAMERA_SD_ERR_BLOCK_READ_NOT_READY;
    }

    ++s_camera_sd_status.block_read_wait_transfer_attempt_count;
    s_camera_sd_status.last_block_read_wait_timeout_ms = timeout_ms;
    start_ms = HAL_GetTick();

    for (;;)
    {
        card_state = HAL_SD_GetCardState(&hsd_snapshot);
        s_camera_sd_status.last_block_read_wait_card_state =
            (uint32_t)card_state;
        elapsed_ms = HAL_GetTick() - start_ms;

        if (card_state == HAL_SD_CARD_TRANSFER)
        {
            ++s_camera_sd_status.block_read_wait_transfer_success_count;
            s_camera_sd_status.last_block_read_wait_operation_ms = elapsed_ms;
            return CAMERA_SD_OK;
        }

        if (elapsed_ms >= timeout_ms)
        {
            ++s_camera_sd_status.block_read_wait_transfer_error_count;
            s_camera_sd_status.last_block_read_wait_operation_ms = elapsed_ms;
            s_camera_sd_status.last_error_code =
                CAMERA_SD_ERR_BLOCK_READ_NOT_READY;
            return CAMERA_SD_ERR_BLOCK_READ_NOT_READY;
        }

        HAL_Delay(1U);
    }
}

/* 与 C5R 读前等待使用相同的 polling 方式，但只更新独立调试状态。 */
static uint32_t Camera_SDStorage_DebugWaitCardTransfer(uint32_t timeout_ms)
{
    uint32_t start_ms = HAL_GetTick();
    uint32_t elapsed_ms;
    HAL_SD_CardStateTypeDef card_state = HAL_SD_GetCardState(&hsd_snapshot);

    s_bus_width_debug.last_wait_timeout_ms = timeout_ms;
    s_bus_width_debug.last_wait_operation_ms = 0U;
    s_bus_width_debug.last_pre_card_state = (uint32_t)card_state;

    for (;;)
    {
        s_bus_width_debug.last_wait_card_state = (uint32_t)card_state;
        elapsed_ms = HAL_GetTick() - start_ms;

        if (card_state == HAL_SD_CARD_TRANSFER)
        {
            s_bus_width_debug.last_wait_operation_ms = elapsed_ms;
            return CAMERA_SD_OK;
        }

