IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_sd_storage.c
void Camera_SDStorage_PrintLineState(void)
{
    uint32_t index;

    LOG_RAW("SD LINESTATE:\r\n");
    LOG_RAW("  linestate_readonly=1\r\n");
    LOG_RAW("  linestate_hal_sd_api_call=0\r\n");
    LOG_RAW("  is_initialized=%lu\r\n", (unsigned long)s_camera_sd_status.is_initialized);
    LOG_RAW("  sdio_ready=%lu\r\n", (unsigned long)s_camera_sd_status.sdio_ready);
    LOG_RAW("  sdio_full_gpio_af12_selected=%lu\r\n", (unsigned long)s_camera_sd_status.sdio_full_gpio_af12_selected);
    LOG_RAW("  sdio_af12_selected=%lu\r\n", (unsigned long)s_camera_sd_status.sdio_af12_selected);
    LOG_RAW("  conflict_pins_released=%lu\r\n", (unsigned long)s_camera_sd_status.conflict_pins_released);
    LOG_RAW("  hal_sd_state=%lu\r\n", (unsigned long)s_camera_sd_status.last_hal_sd_state);
    LOG_RAW("  hal_sd_card_state=%lu\r\n", (unsigned long)s_camera_sd_status.last_hal_sd_card_state);
    LOG_RAW("  gpioc_moder=0x%08lX\r\n", (unsigned long)GPIOC->MODER);
    LOG_RAW("  gpioc_pupdr=0x%08lX\r\n", (unsigned long)GPIOC->PUPDR);
    LOG_RAW("  gpioc_ospeedr=0x%08lX\r\n", (unsigned long)GPIOC->OSPEEDR);
    LOG_RAW("  gpioc_afr1=0x%08lX\r\n", (unsigned long)GPIOC->AFR[1]);
    LOG_RAW("  gpioc_idr=0x%08lX\r\n", (unsigned long)GPIOC->IDR);
    LOG_RAW("  gpiod_moder=0x%08lX\r\n", (unsigned long)GPIOD->MODER);
    LOG_RAW("  gpiod_pupdr=0x%08lX\r\n", (unsigned long)GPIOD->PUPDR);
    LOG_RAW("  gpiod_ospeedr=0x%08lX\r\n", (unsigned long)GPIOD->OSPEEDR);
    LOG_RAW("  gpiod_afr0=0x%08lX\r\n", (unsigned long)GPIOD->AFR[0]);
    LOG_RAW("  gpiod_idr=0x%08lX\r\n", (unsigned long)GPIOD->IDR);

    for (index = 0U;
         index < (sizeof(s_camera_sd_lines) / sizeof(s_camera_sd_lines[0]));
         ++index)
    {
        const Camera_SDLineDef_t *line = &s_camera_sd_lines[index];

        LOG_RAW(
            "  %s_mode=%lu\r\n",
            line->name,
            (unsigned long)Camera_SDStorage_GetPinMode(
                line->port,
                line->pin_number));
        LOG_RAW(
            "  %s_pull=%lu\r\n",
            line->name,
            (unsigned long)Camera_SDStorage_GetPinPull(
                line->port,
                line->pin_number));
        LOG_RAW(
            "  %s_speed=%lu\r\n",
            line->name,
            (unsigned long)Camera_SDStorage_GetPinSpeed(
                line->port,
                line->pin_number));
        LOG_RAW(
            "  %s_af=%lu\r\n",
            line->name,
            (unsigned long)Camera_SDStorage_GetPinAf(
                line->port,
                line->pin_number));
        LOG_RAW(
            "  %s_idr=%lu\r\n",
            line->name,
            (unsigned long)Camera_SDStorage_GetPinIdr(
                line->port,
                line->pin_number));
    }
}

uint32_t Camera_SDStorage_RequestBlockReadTest(uint32_t block_addr)
{
    return Camera_SDStorage_ReadBlockTest(block_addr);
}

uint32_t Camera_SDStorage_AtkOfficialInit(void)
{
    uint32_t start_ms = HAL_GetTick();
    uint32_t result;
    HAL_StatusTypeDef hal_status;
    HAL_SD_CardInfoTypeDef card_info;

    ++s_camera_sd_status.atk_official_init_attempt_count;

    if (s_camera_sd_status.sdio_full_gpio_af12_selected != 1U)
    {
        ++s_camera_sd_status.atk_official_init_error_count;
        s_camera_sd_status.atk_official_init_ready = 0U;
        s_camera_sd_status.atk_official_last_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_NEED_TAKEOVER;
    }

    if (Camera_SDStorage_IsTakeoverPreconditionReady() == 0U)
    {
        ++s_camera_sd_status.atk_official_init_error_count;
        s_camera_sd_status.atk_official_init_ready = 0U;
        s_camera_sd_status.atk_official_last_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_SNAPSHOT_NOT_PAUSED;
    }

    Camera_SDStorage_ResetAtkOfficialAttemptStatus();

    result = Camera_SDStorage_ApplyAtkOfficialSdioGpioConfig();
    if (result != CAMERA_SD_OK)
    {
        ++s_camera_sd_status.atk_official_init_error_count;
        s_camera_sd_status.atk_official_last_operation_ms =
            HAL_GetTick() - start_ms;
        return result;
    }

    Camera_SDStorage_EnableSdioClock();
    s_atk_official_path_active = 1U;
    Camera_SDStorage_PrepareAtkOfficialSdHandle();

    hal_status = HAL_SD_Init(&hsd_snapshot);
    s_camera_sd_status.atk_official_hal_init_status =
        (uint32_t)hal_status;
    s_camera_sd_status.atk_official_hal_error =
        HAL_SD_GetError(&hsd_snapshot);

    if (hal_status != HAL_OK)
    {
        ++s_camera_sd_status.atk_official_init_error_count;
        s_camera_sd_status.atk_official_last_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_SDIO_HAL_INIT_FAILED;
    }

    s_atk_official_hal_initialized = 1U;
    s_camera_sd_status.atk_official_bus_width_after_init = 1U;

    hal_status = HAL_SD_GetCardInfo(&hsd_snapshot, &card_info);
    s_camera_sd_status.atk_official_cardinfo_status =
        (uint32_t)hal_status;
    s_camera_sd_status.atk_official_cardinfo_error =
        HAL_SD_GetError(&hsd_snapshot);

    if (hal_status != HAL_OK)
    {
        ++s_camera_sd_status.atk_official_init_error_count;
        s_camera_sd_status.atk_official_last_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_CARD_INFO_FAILED;
    }

    hal_status = HAL_SD_ConfigWideBusOperation(
        &hsd_snapshot,
        SDIO_BUS_WIDE_4B);
    s_camera_sd_status.atk_official_widebus_status =
        (uint32_t)hal_status;
    s_camera_sd_status.atk_official_widebus_error =
        HAL_SD_GetError(&hsd_snapshot);

    if (hal_status != HAL_OK)
    {
        ++s_camera_sd_status.atk_official_init_error_count;
        s_camera_sd_status.atk_official_last_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_BUS_WIDTH_CONFIG_FAILED;
    }

    s_camera_sd_status.atk_official_bus_width_after_widebus = 4U;
    result = Camera_SDStorage_AtkOfficialWaitCardTransfer(
        CAMERA_SD_ATK_WAIT_TRANSFER_TIMEOUT_MS);
    if (result != CAMERA_SD_OK)
    {
        ++s_camera_sd_status.atk_official_init_error_count;
        s_camera_sd_status.atk_official_last_operation_ms =
            HAL_GetTick() - start_ms;
        return result;
    }

    ++s_camera_sd_status.atk_official_init_success_count;
    s_camera_sd_status.atk_official_init_ready = 1U;
    s_camera_sd_status.atk_official_last_operation_ms =
        HAL_GetTick() - start_ms;
    return CAMERA_SD_OK;
}

uint32_t Camera_SDStorage_AtkOfficial1BitInit(void)
{
    uint32_t start_ms = HAL_GetTick();
    uint32_t result;
    HAL_StatusTypeDef hal_status;
    HAL_SD_CardInfoTypeDef card_info;

    ++s_camera_sd_status.atk_1bit_init_attempt_count;

    if (Camera_SDStorage_IsTakeoverPreconditionReady() == 0U)
    {
        ++s_camera_sd_status.atk_1bit_init_error_count;
        s_camera_sd_status.atk_1bit_init_ready = 0U;
        s_camera_sd_status.atk_1bit_last_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_SNAPSHOT_NOT_PAUSED;
    }

    if (s_camera_sd_status.sdio_full_gpio_af12_selected != 1U)
    {
        ++s_camera_sd_status.atk_1bit_init_error_count;
        s_camera_sd_status.atk_1bit_init_ready = 0U;
        s_camera_sd_status.atk_1bit_last_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_NEED_TAKEOVER;
    }

