IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_sd_storage.c
    Camera_SDStorage_ResetAtk1BitAttemptStatus();
    ++s_camera_sd_status.atk_1bit_gpio_config_attempt_count;
    result = Camera_SDStorage_ApplyAtkOfficialSdioGpioConfig();
    if (result != CAMERA_SD_OK)
    {
        ++s_camera_sd_status.atk_1bit_init_error_count;
        s_camera_sd_status.atk_1bit_last_operation_ms =
            HAL_GetTick() - start_ms;
        return result;
    }
    ++s_camera_sd_status.atk_1bit_gpio_config_success_count;

    Camera_SDStorage_EnableSdioClock();
    s_atk_1bit_path_active = 1U;
    Camera_SDStorage_PrepareAtkOfficialSdHandle();

    hal_status = HAL_SD_Init(&hsd_snapshot);
    s_camera_sd_status.atk_1bit_hal_init_status = (uint32_t)hal_status;
    s_camera_sd_status.atk_1bit_hal_error =
        HAL_SD_GetError(&hsd_snapshot);
    if (hal_status != HAL_OK)
    {
        ++s_camera_sd_status.atk_1bit_init_error_count;
        s_camera_sd_status.atk_1bit_last_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_SDIO_HAL_INIT_FAILED;
    }

    s_atk_1bit_hal_initialized = 1U;
    s_camera_sd_status.atk_1bit_bus_width = 1U;
    hal_status = HAL_SD_GetCardInfo(&hsd_snapshot, &card_info);
    s_camera_sd_status.atk_1bit_cardinfo_status = (uint32_t)hal_status;
    s_camera_sd_status.atk_1bit_cardinfo_error =
        HAL_SD_GetError(&hsd_snapshot);
    if (hal_status != HAL_OK)
    {
        ++s_camera_sd_status.atk_1bit_init_error_count;
        s_camera_sd_status.atk_1bit_last_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_CARD_INFO_FAILED;
    }

    result = Camera_SDStorage_Atk1BitWaitCardTransfer(
        CAMERA_SD_ATK_WAIT_TRANSFER_TIMEOUT_MS);
    if (result != CAMERA_SD_OK)
    {
        ++s_camera_sd_status.atk_1bit_init_error_count;
        s_camera_sd_status.atk_1bit_last_operation_ms =
            HAL_GetTick() - start_ms;
        return result;
    }

    ++s_camera_sd_status.atk_1bit_init_success_count;
    s_camera_sd_status.atk_1bit_init_ready = 1U;
    s_camera_sd_status.atk_1bit_last_operation_ms =
        HAL_GetTick() - start_ms;
    return CAMERA_SD_OK;
}

uint32_t Camera_SDStorage_AtkOfficial1BitReadBlock(uint32_t block_addr)
{
    uint8_t *read_buffer = (uint8_t *)s_atk_1bit_read_buffer_words;
    uint32_t operation_start_ms;
    uint32_t wait_start_ms;
    uint32_t primask;
    uint32_t wait_poll_count = 0U;
    uint32_t wait_success = 0U;
    uint32_t hal_error;
    HAL_StatusTypeDef hal_status;
    HAL_SD_CardStateTypeDef card_state;

    if ((s_camera_sd_status.atk_1bit_init_ready != 1U) ||
        (s_atk_1bit_hal_initialized != 1U) ||
        (s_atk_1bit_path_active != 1U))
    {
        return CAMERA_SD_ERR_BLOCK_READ_NOT_READY;
    }

    memset(read_buffer, CAMERA_SD_READ_PREFILL_PATTERN,
           sizeof(s_atk_1bit_read_buffer_words));
    ++s_camera_sd_status.atk_1bit_read_attempt_count;
    s_camera_sd_status.atk_1bit_last_read_addr = block_addr;
    s_camera_sd_status.atk_1bit_last_read_count = 1U;
    s_camera_sd_status.atk_1bit_last_read_size = 0U;
    s_camera_sd_status.atk_1bit_read_wait_timeout_ms =
        CAMERA_SD_ATK_1BIT_READ_TIMEOUT_MS;
    s_camera_sd_status.atk_1bit_read_pre_card_state =
        (uint32_t)HAL_SD_GetCardState(&hsd_snapshot);

    operation_start_ms = HAL_GetTick();
    primask = __get_PRIMASK();
    __disable_irq();

    hal_status = HAL_SD_ReadBlocks(
        &hsd_snapshot,
        read_buffer,
        block_addr,
        1U,
        CAMERA_SD_ATK_1BIT_READ_TIMEOUT_MS);
    hal_error = HAL_SD_GetError(&hsd_snapshot);
    card_state = HAL_SD_GetCardState(&hsd_snapshot);
    s_camera_sd_status.atk_1bit_read_post_card_state =
        (uint32_t)card_state;
    wait_start_ms = HAL_GetTick();

    for (;;)
    {
        s_camera_sd_status.atk_1bit_read_wait_card_state =
            (uint32_t)card_state;
        if (card_state == HAL_SD_CARD_TRANSFER)
        {
            wait_success = 1U;
            break;
        }

        if (wait_poll_count >= CAMERA_SD_ATK_1BIT_WAIT_POLL_LIMIT)
        {
            break;
        }

        ++wait_poll_count;
        card_state = HAL_SD_GetCardState(&hsd_snapshot);
    }

    if (primask == 0U)
    {
        __enable_irq();
    }

    s_camera_sd_status.atk_1bit_last_read_operation_ms =
        HAL_GetTick() - operation_start_ms;
    s_camera_sd_status.atk_1bit_read_wait_operation_ms =
        HAL_GetTick() - wait_start_ms;
    s_camera_sd_status.atk_1bit_last_read_status = (uint32_t)hal_status;
    s_camera_sd_status.atk_1bit_last_read_error = hal_error;
    s_camera_sd_status.atk_1bit_read_error_is_data_crc_fail =
        ((hal_error & HAL_SD_ERROR_DATA_CRC_FAIL) != 0U) ? 1U : 0U;
    s_camera_sd_status.atk_1bit_read_error_is_cmd_crc_fail =
        ((hal_error & HAL_SD_ERROR_CMD_CRC_FAIL) != 0U) ? 1U : 0U;
    s_camera_sd_status.atk_1bit_read_error_is_cmd_rsp_timeout =
        ((hal_error & HAL_SD_ERROR_CMD_RSP_TIMEOUT) != 0U) ? 1U : 0U;
    s_camera_sd_status.atk_1bit_read_error_is_data_timeout =
        ((hal_error & HAL_SD_ERROR_DATA_TIMEOUT) != 0U) ? 1U : 0U;
    s_camera_sd_status.atk_1bit_read_error_is_rx_overrun =
        ((hal_error & HAL_SD_ERROR_RX_OVERRUN) != 0U) ? 1U : 0U;
    s_camera_sd_status.atk_1bit_read_error_is_tx_underrun =
        ((hal_error & HAL_SD_ERROR_TX_UNDERRUN) != 0U) ? 1U : 0U;
    Camera_SDStorage_AnalyzeAtk1BitReadBuffer(
        (const uint8_t *)read_buffer,
        CAMERA_SD_READ_BUFFER_LEN);

    if ((hal_status == HAL_OK) && (wait_success != 0U))
    {
        ++s_camera_sd_status.atk_1bit_read_success_count;
        s_camera_sd_status.atk_1bit_last_read_size =
            CAMERA_SD_READ_BUFFER_LEN;
        return CAMERA_SD_OK;
    }

    ++s_camera_sd_status.atk_1bit_read_error_count;
    if (hal_status != HAL_OK)
    {
        return CAMERA_SD_ERR_BLOCK_READ_FAILED;
    }

    return CAMERA_SD_ERR_BLOCK_READ_NOT_READY;
}

uint32_t Camera_SDStorage_RequestInit(void)
{
    uint32_t start_ms = HAL_GetTick();
    uint32_t hal_start_ms;
    HAL_StatusTypeDef hal_status;

    ++s_camera_sd_status.init_attempt_count;

    if (s_camera_sd_status.sdio_full_gpio_af12_selected != 1U)
    {
        /* 完整 SDIO GPIO 未接管时只返回 NEED_TAKEOVER，不调用 HAL_SD_Init。 */
        s_camera_sd_status.last_error_code = CAMERA_SD_ERR_NEED_TAKEOVER;
        s_camera_sd_status.is_initialized = 0U;
        s_camera_sd_status.takeover_required = 1U;
        s_camera_sd_status.sdio_ready = 0U;
        s_camera_sd_status.fatfs_ready = 0U;
        s_camera_sd_status.last_operation_ms = HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_NEED_TAKEOVER;
    }

    Camera_SDStorage_PrepareSdHandle();
    Camera_SDStorage_EnableSdioClock();
    ++s_camera_sd_status.sdio_hal_init_attempt_count;

    hal_start_ms = HAL_GetTick();
    hal_status = HAL_SD_Init(&hsd_snapshot);
    s_camera_sd_status.last_sdio_hal_init_operation_ms =
        HAL_GetTick() - hal_start_ms;
    s_camera_sd_status.last_hal_sd_init_status = (uint32_t)hal_status;
    s_camera_sd_status.last_hal_sd_error = HAL_SD_GetError(&hsd_snapshot);
    s_camera_sd_status.fatfs_ready = 0U;

    if (hal_status == HAL_OK)
    {
        uint32_t card_info_result;

        ++s_camera_sd_status.init_success_count;
        ++s_camera_sd_status.sdio_hal_init_success_count;
        s_camera_sd_status.is_initialized = 1U;
        s_camera_sd_status.sdio_ready = 1U;
        card_info_result = Camera_SDStorage_ReadCardInfo();
        s_camera_sd_status.last_operation_ms = HAL_GetTick() - start_ms;
        return card_info_result;
    }

    ++s_camera_sd_status.init_error_count;
    ++s_camera_sd_status.sdio_hal_init_error_count;
    s_camera_sd_status.is_initialized = 0U;
    s_camera_sd_status.sdio_ready = 0U;
    s_camera_sd_status.last_error_code = CAMERA_SD_ERR_SDIO_HAL_INIT_FAILED;
    s_camera_sd_status.last_operation_ms = HAL_GetTick() - start_ms;
    return CAMERA_SD_ERR_SDIO_HAL_INIT_FAILED;
}

uint32_t Camera_SDStorage_RequestTakeoverEnter(void)
{
    uint32_t start_ms = HAL_GetTick();
    uint32_t result;

    ++s_camera_sd_status.takeover_enter_attempt_count;
    ++s_camera_sd_status.takeover_precheck_attempt_count;

    if (Camera_SDStorage_IsTakeoverPreconditionReady() == 0U)
    {
        ++s_camera_sd_status.takeover_precheck_fail_count;
        s_camera_sd_status.snapshot_pause_confirmed = 0U;
        s_camera_sd_status.conflict_pin_release_ready = 0U;
        s_camera_sd_status.conflict_pins_released = 0U;
        s_camera_sd_status.sdio_af12_selected = 0U;
        s_camera_sd_status.sdio_full_gpio_af12_selected = 0U;
        /* 前置条件失败时保持 IDLE，避免误认为接管流程已经开始。 */
        s_camera_sd_status.takeover_state = CAMERA_SD_TAKEOVER_STATE_IDLE;
        s_camera_sd_status.last_takeover_error_code =
            CAMERA_SD_ERR_SNAPSHOT_NOT_PAUSED;
        s_camera_sd_status.last_takeover_precheck_error_code =
            CAMERA_SD_ERR_SNAPSHOT_NOT_PAUSED;
        result = CAMERA_SD_ERR_SNAPSHOT_NOT_PAUSED;
    }
    else
    {
        uint32_t pin_result;

        ++s_camera_sd_status.takeover_precheck_success_count;
        s_camera_sd_status.snapshot_pause_confirmed = 1U;
        s_camera_sd_status.conflict_pin_release_ready = 1U;
        s_camera_sd_status.last_takeover_precheck_error_code = CAMERA_SD_OK;

        pin_result = Camera_SDStorage_ReleaseConflictPins();
        if (pin_result == CAMERA_SD_OK)
        {
            uint32_t af12_result;

            af12_result = Camera_SDStorage_SwitchConflictPinsToSdioAf12();
            if (af12_result == CAMERA_SD_OK)
            {
                uint32_t full_gpio_result;

                full_gpio_result =
                    Camera_SDStorage_SwitchFullSdioGpioToAf12();
                if (full_gpio_result == CAMERA_SD_OK)
                {
                    /* 六个 SDIO GPIO 已切换到 AF12，但不初始化 SDIO 外设。 */
                    s_camera_sd_status.sdio_af12_selected = 1U;
                    s_camera_sd_status.sdio_full_gpio_af12_selected = 1U;
                    s_camera_sd_status.conflict_pins_released = 0U;
                    s_camera_sd_status.takeover_state =
                        CAMERA_SD_TAKEOVER_STATE_ENTER_DEFERRED;
                    s_camera_sd_status.last_conflict_pin_error_code =
                        CAMERA_SD_OK;
                    s_camera_sd_status.last_sdio_af12_error_code = CAMERA_SD_OK;
                    s_camera_sd_status.last_sdio_full_gpio_error_code =
                        CAMERA_SD_OK;
                    s_camera_sd_status.last_takeover_precheck_error_code =
                        CAMERA_SD_OK;
                    s_camera_sd_status.last_takeover_error_code =
                        CAMERA_SD_ERR_TAKEOVER_NOT_IMPLEMENTED;
                    result = CAMERA_SD_ERR_TAKEOVER_NOT_IMPLEMENTED;
                }
                else
                {
                    ++s_camera_sd_status.takeover_error_count;
                    s_camera_sd_status.sdio_full_gpio_af12_selected = 0U;
                    s_camera_sd_status.takeover_state =
                        CAMERA_SD_TAKEOVER_STATE_ERROR;
                    s_camera_sd_status.last_takeover_error_code =
                        CAMERA_SD_ERR_SDIO_FULL_GPIO_SWITCH_FAILED;
                    result = CAMERA_SD_ERR_SDIO_FULL_GPIO_SWITCH_FAILED;
                }
            }
            else
            {
                ++s_camera_sd_status.takeover_error_count;
                s_camera_sd_status.sdio_af12_selected = 0U;
                s_camera_sd_status.sdio_full_gpio_af12_selected = 0U;
                s_camera_sd_status.takeover_state =
                    CAMERA_SD_TAKEOVER_STATE_ERROR;
                s_camera_sd_status.last_takeover_error_code =
                    CAMERA_SD_ERR_SDIO_AF12_SWITCH_FAILED;
                result = CAMERA_SD_ERR_SDIO_AF12_SWITCH_FAILED;
            }
        }
        else
        {
            ++s_camera_sd_status.takeover_error_count;
            s_camera_sd_status.conflict_pin_release_ready = 0U;
            s_camera_sd_status.sdio_af12_selected = 0U;
            s_camera_sd_status.sdio_full_gpio_af12_selected = 0U;
            s_camera_sd_status.takeover_state =
                CAMERA_SD_TAKEOVER_STATE_ERROR;
            s_camera_sd_status.last_takeover_error_code =
                CAMERA_SD_ERR_CONFLICT_PIN_RELEASE_FAILED;
            result = CAMERA_SD_ERR_CONFLICT_PIN_RELEASE_FAILED;
        }
    }

    s_camera_sd_status.last_takeover_operation_ms = HAL_GetTick() - start_ms;

    return result;
}

uint32_t Camera_SDStorage_RequestTakeoverExit(void)
{
    uint32_t start_ms = HAL_GetTick();
    uint32_t pin_result;
    uint32_t result;

    ++s_camera_sd_status.takeover_exit_attempt_count;
    s_camera_sd_status.conflict_pin_release_ready = 0U;

    if (s_atk_1bit_path_active != 0U)
    {
        if ((s_atk_1bit_hal_initialized != 0U) ||
            (s_camera_sd_status.atk_1bit_init_ready != 0U))
        {
            (void)HAL_SD_DeInit(&hsd_snapshot);
        }

        if (s_camera_sd_status.sdio_clock_enabled != 0U)
        {
            Camera_SDStorage_DisableSdioClock();
        }

