IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_sd_storage.c
        s_atk_1bit_path_active = 0U;
        s_atk_1bit_hal_initialized = 0U;
        s_camera_sd_status.atk_1bit_init_ready = 0U;
    }
    else if (s_atk_official_path_active != 0U)
    {
        if ((s_atk_official_hal_initialized != 0U) ||
            (s_camera_sd_status.atk_official_init_ready != 0U))
        {
            (void)HAL_SD_DeInit(&hsd_snapshot);
        }

        if (s_camera_sd_status.sdio_clock_enabled != 0U)
        {
            Camera_SDStorage_DisableSdioClock();
        }

        s_atk_official_path_active = 0U;
        s_atk_official_hal_initialized = 0U;
        s_camera_sd_status.atk_official_init_ready = 0U;
    }
    else if ((s_camera_sd_status.is_initialized != 0U) ||
             (s_camera_sd_status.sdio_clock_enabled != 0U))
    {
        uint32_t hal_start_ms = HAL_GetTick();
        HAL_StatusTypeDef hal_status;

        ++s_camera_sd_status.sdio_hal_deinit_attempt_count;
        hal_status = HAL_SD_DeInit(&hsd_snapshot);
        s_camera_sd_status.last_sdio_hal_deinit_operation_ms =
            HAL_GetTick() - hal_start_ms;
        s_camera_sd_status.last_hal_sd_deinit_status = (uint32_t)hal_status;
        s_camera_sd_status.last_hal_sd_error = HAL_SD_GetError(&hsd_snapshot);

        if (hal_status == HAL_OK)
        {
            ++s_camera_sd_status.sdio_hal_deinit_success_count;
        }
        else
        {
            ++s_camera_sd_status.sdio_hal_deinit_error_count;
            s_camera_sd_status.last_error_code =
                CAMERA_SD_ERR_SDIO_HAL_DEINIT_FAILED;
        }

        /* 即使 HAL_SD_DeInit 失败，也必须关时钟并继续恢复 GPIO。 */
        Camera_SDStorage_DisableSdioClock();
    }

    s_camera_sd_status.is_initialized = 0U;
    s_camera_sd_status.sdio_ready = 0U;
    s_camera_sd_status.fatfs_ready = 0U;

    if (s_camera_sd_status.sdio_full_gpio_af12_selected != 0U)
    {
        uint32_t full_gpio_result =
            Camera_SDStorage_LeaveFullSdioGpioToInput();

        if (full_gpio_result != CAMERA_SD_OK)
        {
            ++s_camera_sd_status.takeover_error_count;
            s_camera_sd_status.sdio_af12_selected = 0U;
            s_camera_sd_status.takeover_state = CAMERA_SD_TAKEOVER_STATE_ERROR;
            s_camera_sd_status.last_takeover_error_code =
                CAMERA_SD_ERR_SDIO_FULL_GPIO_RESTORE_FAILED;
            s_camera_sd_status.last_takeover_operation_ms =
                HAL_GetTick() - start_ms;
            return CAMERA_SD_ERR_SDIO_FULL_GPIO_RESTORE_FAILED;
        }
    }
    else if (s_camera_sd_status.sdio_af12_selected != 0U)
    {
        uint32_t af12_result = Camera_SDStorage_LeaveSdioAf12ToInput();

        if (af12_result != CAMERA_SD_OK)
        {
            ++s_camera_sd_status.takeover_error_count;
            s_camera_sd_status.takeover_state = CAMERA_SD_TAKEOVER_STATE_ERROR;
            s_camera_sd_status.last_takeover_error_code =
                CAMERA_SD_ERR_SDIO_AF12_RESTORE_FAILED;
            s_camera_sd_status.last_takeover_operation_ms =
                HAL_GetTick() - start_ms;
            return CAMERA_SD_ERR_SDIO_AF12_RESTORE_FAILED;
        }
    }

    pin_result = Camera_SDStorage_RestoreConflictPins();

    if (pin_result == CAMERA_SD_OK)
    {
        s_camera_sd_status.conflict_pins_released = 0U;
        s_camera_sd_status.sdio_af12_selected = 0U;
        s_camera_sd_status.sdio_full_gpio_af12_selected = 0U;
        s_camera_sd_status.snapshot_pause_confirmed = 0U;
        s_camera_sd_status.takeover_state =
            CAMERA_SD_TAKEOVER_STATE_EXIT_DEFERRED;
        s_camera_sd_status.last_conflict_pin_error_code = CAMERA_SD_OK;
        s_camera_sd_status.last_sdio_af12_error_code = CAMERA_SD_OK;
        s_camera_sd_status.last_sdio_full_gpio_error_code = CAMERA_SD_OK;
        s_camera_sd_status.last_takeover_error_code =
            CAMERA_SD_ERR_TAKEOVER_NOT_IMPLEMENTED;
        result = CAMERA_SD_ERR_TAKEOVER_NOT_IMPLEMENTED;
    }
    else
    {
        ++s_camera_sd_status.takeover_error_count;
        s_camera_sd_status.takeover_state = CAMERA_SD_TAKEOVER_STATE_ERROR;
        s_camera_sd_status.last_takeover_error_code =
            CAMERA_SD_ERR_CONFLICT_PIN_RESTORE_FAILED;
        result = CAMERA_SD_ERR_CONFLICT_PIN_RESTORE_FAILED;
    }

    s_camera_sd_status.last_takeover_operation_ms = HAL_GetTick() - start_ms;

    return result;
}

const char *Camera_SDStorage_ErrorToString(uint32_t error_code)
{
    switch (error_code)
    {
        case CAMERA_SD_OK:
            return "OK";

        case CAMERA_SD_ERR_NOT_IMPLEMENTED:
            return "NOT_IMPLEMENTED";

        case CAMERA_SD_ERR_PIN_CONFLICT:
            return "PIN_CONFLICT";

        case CAMERA_SD_ERR_NEED_TAKEOVER:
            return "NEED_TAKEOVER";

        case CAMERA_SD_ERR_INIT_FAILED:
            return "INIT_FAILED";

        case CAMERA_SD_ERR_INVALID_ARGUMENT:
            return "INVALID_ARGUMENT";

        case CAMERA_SD_ERR_TAKEOVER_NOT_IMPLEMENTED:
            return "TAKEOVER_NOT_IMPLEMENTED";

        case CAMERA_SD_ERR_TAKEOVER_NOT_ACTIVE:
            return "TAKEOVER_NOT_ACTIVE";

        case CAMERA_SD_ERR_TAKEOVER_ALREADY_ACTIVE:
            return "TAKEOVER_ALREADY_ACTIVE";

        case CAMERA_SD_ERR_SNAPSHOT_NOT_PAUSED:
            return "SNAPSHOT_NOT_PAUSED";

        case CAMERA_SD_ERR_TAKEOVER_PRECHECK_FAILED:
            return "TAKEOVER_PRECHECK_FAILED";

        case CAMERA_SD_ERR_CONFLICT_PIN_RELEASE_FAILED:
            return "CONFLICT_PIN_RELEASE_FAILED";

        case CAMERA_SD_ERR_CONFLICT_PIN_RESTORE_FAILED:
            return "CONFLICT_PIN_RESTORE_FAILED";

        case CAMERA_SD_ERR_CONFLICT_PIN_NOT_RELEASED:
            return "CONFLICT_PIN_NOT_RELEASED";

        case CAMERA_SD_ERR_SDIO_AF12_SWITCH_FAILED:
            return "SDIO_AF12_SWITCH_FAILED";

        case CAMERA_SD_ERR_SDIO_AF12_RESTORE_FAILED:
            return "SDIO_AF12_RESTORE_FAILED";

        case CAMERA_SD_ERR_SDIO_FULL_GPIO_SWITCH_FAILED:
            return "SDIO_FULL_GPIO_SWITCH_FAILED";

        case CAMERA_SD_ERR_SDIO_FULL_GPIO_RESTORE_FAILED:
            return "SDIO_FULL_GPIO_RESTORE_FAILED";

        case CAMERA_SD_ERR_SDIO_HAL_INIT_FAILED:
            return "SDIO_HAL_INIT_FAILED";

        case CAMERA_SD_ERR_SDIO_HAL_DEINIT_FAILED:
            return "SDIO_HAL_DEINIT_FAILED";

        case CAMERA_SD_ERR_CARD_INFO_FAILED:
            return "CARD_INFO_FAILED";

        case CAMERA_SD_ERR_BLOCK_READ_NOT_READY:
            return "BLOCK_READ_NOT_READY";

        case CAMERA_SD_ERR_BLOCK_READ_FAILED:
            return "BLOCK_READ_FAILED";

        case CAMERA_SD_ERR_BUS_WIDTH_NOT_READY:
            return "BUS_WIDTH_NOT_READY";

        case CAMERA_SD_ERR_BUS_WIDTH_INVALID:
            return "BUS_WIDTH_INVALID";

        case CAMERA_SD_ERR_BUS_WIDTH_WAIT_TRANSFER_FAILED:
            return "BUS_WIDTH_WAIT_TRANSFER_FAILED";

        case CAMERA_SD_ERR_BUS_WIDTH_CONFIG_FAILED:
            return "BUS_WIDTH_CONFIG_FAILED";

        default:
            return "UNKNOWN_ERROR";
    }
}

const char *Camera_SDStorage_TakeoverStateToString(uint32_t state)
{
    switch (state)
    {
        case CAMERA_SD_TAKEOVER_STATE_IDLE:
            return "IDLE";

        case CAMERA_SD_TAKEOVER_STATE_ENTER_DEFERRED:
            return "ENTER_DEFERRED";

        case CAMERA_SD_TAKEOVER_STATE_ACTIVE:
            return "ACTIVE";

        case CAMERA_SD_TAKEOVER_STATE_EXIT_DEFERRED:
            return "EXIT_DEFERRED";

        case CAMERA_SD_TAKEOVER_STATE_ERROR:
            return "ERROR";

        default:
            return "UNKNOWN";
    }
}
